ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_R_ADC_R_RESULTS_502C6000h.xml
		<bitfield id="MINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Index of the Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB2MAX" acronym="ADC_R_RESULTS_ADCPPB2MAX" offset="96" width="32" description="ADC PPB 2 Final Max Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only when a count-match event occurs].  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information].  " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB2MAXI" acronym="ADC_R_RESULTS_ADCPPB2MAXI" offset="100" width="16" description="ADC PPB 2 Final Max Index Result Register.">
		<bitfield id="MAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Index of the Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB2MIN" acronym="ADC_R_RESULTS_ADCPPB2MIN" offset="104" width="32" description="ADC PPB 2 Final Min Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB2MINI" acronym="ADC_R_RESULTS_ADCPPB2MINI" offset="108" width="16" description="ADC PPB 2 Final Min Index Result Register.">
		<bitfield id="MINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Index of the Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB3MAX" acronym="ADC_R_RESULTS_ADCPPB3MAX" offset="112" width="32" description="ADC PPB 3 Final Max Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only when a count-match event occurs].  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information].  " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB3MAXI" acronym="ADC_R_RESULTS_ADCPPB3MAXI" offset="116" width="16" description="ADC PPB 3 Final Max Index Result Register.">
		<bitfield id="MAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Index of the Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB3MIN" acronym="ADC_R_RESULTS_ADCPPB3MIN" offset="120" width="32" description="ADC PPB 3 Final Min Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB3MINI" acronym="ADC_R_RESULTS_ADCPPB3MINI" offset="124" width="16" description="ADC PPB 3 Final Min Index Result Register.">
		<bitfield id="MINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Index of the Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB4MAX" acronym="ADC_R_RESULTS_ADCPPB4MAX" offset="128" width="32" description="ADC PPB 4 Final Max Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only when a count-match event occurs].  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information].  " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB4MAXI" acronym="ADC_R_RESULTS_ADCPPB4MAXI" offset="132" width="16" description="ADC PPB 4 Final Max Index Result Register.">
		<bitfield id="MAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Index of the Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB4MIN" acronym="ADC_R_RESULTS_ADCPPB4MIN" offset="136" width="32" description="ADC PPB 4 Final Min Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_RESULTS_ADCPPB4MINI" acronym="ADC_R_RESULTS_ADCPPB4MINI" offset="140" width="16" description="ADC PPB 4 Final Min Index Result Register.">
		<bitfield id="MINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Index of the Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register>
</module>